package com.example.gcxl.domain;

public enum ReturnCode {
    /**操作成功**/
    RC100(100,"操作成功"),

    RC101(101,"用户名被占用"),
    RC102(102,"插入过程出现未知错误"),
    RC201(201,"用户不存在"),
    RC202(202,"用户密码错误"),
    RC203(203,"验证码错误"),
    RC204(204,"update错误"),

    RC301(301,"上传的文件为空"),
    RC302(302,"上传的文件的大小超出了限制值"),
    RC303(303,"上传的文件状态异常"),
    RC304(304,"上传的文件类型超出了限制"),
    RC305(305,"上传文件时读写异常"),
    RC306(306,"采购合同不存在"),
    RC307(307,"不存在要修改的信息"),
    RC308(308,"合同已存在"),
    RC309(309,"发票已存在"),
    RC310(310,"发票不存在"),
    RC311(311,"发票明细已存在"),
    RC312(312,"发票明细不存在"),
    RC313(313,"采购数量过小，采购数量小于关联数量+出库数量"),
    RC314(314,"发票金额过大，已超过合同金额"),
    RC315(315,"合同金额小于已开票的发票金额"),

    RC401(401,"出库编号已存在"),
    RC402(402,"出库编号不存在"),
    RC5001(5001,"开始时间和截止时间必须一起输入"),

    /**操作失败**/
    RC998(998,"传入的数据存在空值"),
    RC999(999,"操作失败"),
    RC1000(1000,"account为空,登录异常"),


    RC2000(2000,"合同所属已存在"),


    RC2010(2010,"采购发票已存在"),
    RC2011(2011,"销售合同不存在");
    /**自定义状态码**/
    private final int code;
    /**自定义描述**/
    private final String message;

    ReturnCode(int code, String message){
        this.code = code;
        this.message = message;
    }


    public int getCode() {
        return code;
    }

    public String getMessage() {
        return message;
    }
}
